simpleFoam/H15V15/D050L474W090Z002H150V015_C/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       off;

geometry
{
    cylinder.stl
    {
        type triSurfaceMesh;
        name cylinder;
    }

    refinementBox
    {
        type box;
        min  (  -0.3   -0.395   0);
        max  (1 0.395  0.12);
    }
}

castellatedMeshControls
{
    features
    (
      { file  "cylinder.eMesh"; level 1; }
    );

    refinementSurfaces
    {
        cylinder
        {
            level (2 3);
            patchInfo { type wall; }
        }
    }

    refinementRegions
    {
        refinementBox
        {
            mode inside;
            levels ((1E15 2));
        }
    }

    locationInMesh (-0.253 0.033 0.033);
}

snapControls
{
    explicitFeatureSnap    true;
    implicitFeatureSnap    false;
}

addLayersControls
{
    layers
    {
        cylinder
        {
            nSurfaceLayers 6;

            expansionRatio 1.3;
            finalLayerThickness 0.5;
            minThickness 1e-5;
        }
    }

    relativeSizes       true;
    expansionRatio      1.2;
    finalLayerThickness 0.5;
    minThickness        1e-3;

    // nGrow 0;

    // featureAngle 130;
}

meshQualityControls
{
    #include "meshQualityDict"

    relaxed
    {
        
        maxNonOrtho 75;
    }

    nSmoothScale 4;
    errorReduction 0.75;
}

writeFlags
(
    noRefinement
    scalarLevels
    layerSets
    layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
